### [ env/poc ] terraform plan
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.azurerm_cosmosdb_sql_role_definition.cosmos-contributor-role will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_cosmosdb_sql_role_definition" "cosmos-contributor-role" {
      + account_name        = "faspo-poc-cdb"
      + assignable_scopes   = (known after apply)
      + id                  = (known after apply)
      + name                = (known after apply)
      + permissions         = (known after apply)
      + resource_group_name = "faspo-poc-data-rg"
      + role_definition_id  = "00000000-0000-0000-0000-000000000002"
      + type                = (known after apply)
    }

  # data.azurerm_cosmosdb_sql_role_definition.cosmos-reader-role will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_cosmosdb_sql_role_definition" "cosmos-reader-role" {
      + account_name        = "faspo-poc-cdb"
      + assignable_scopes   = (known after apply)
      + id                  = (known after apply)
      + name                = (known after apply)
      + permissions         = (known after apply)
      + resource_group_name = "faspo-poc-data-rg"
      + role_definition_id  = "00000000-0000-0000-0000-000000000001"
      + type                = (known after apply)
    }

  # azurerm_cosmosdb_account.cdb will be updated in-place
  ~ resource "azurerm_cosmosdb_account" "cdb" {
        id                                       = "/subscriptions/8490b0ec-5a8a-4de8-bc0b-5cf01d498a30/resourceGroups/faspo-poc-data-rg/providers/Microsoft.DocumentDB/databaseAccounts/faspo-poc-cdb"
      ~ is_virtual_network_filter_enabled        = true -> false
        name                                     = "faspo-poc-cdb"
        tags                                     = {}
        # (30 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # azurerm_cosmosdb_sql_container.document-container must be replaced
-/+ resource "azurerm_cosmosdb_sql_container" "document-container" {
      ~ id                  = "/subscriptions/8490b0ec-5a8a-4de8-bc0b-5cf01d498a30/resourceGroups/faspo-poc-data-rg/providers/Microsoft.DocumentDB/databaseAccounts/faspo-poc-cdb/sqlDatabases/faspo-poc-cdb/containers/document" -> (known after apply)
        name                = "document"
      ~ partition_key_paths = [ # forces replacement
          ~ "/subjectId" -> "/subject_id",
        ]
      + throughput          = (known after apply)
        # (5 unchanged attributes hidden)

      ~ conflict_resolution_policy (known after apply)
      - conflict_resolution_policy {
          - conflict_resolution_path      = "/_ts" -> null
          - mode                          = "LastWriterWins" -> null
            # (1 unchanged attribute hidden)
        }

        # (1 unchanged block hidden)
    }

  # azurerm_cosmosdb_sql_container.process-container will be created
  + resource "azurerm_cosmosdb_sql_container" "process-container" {
      + account_name        = "faspo-poc-cdb"
      + database_name       = "faspo-poc-cdb"
      + id                  = (known after apply)
      + name                = "process"
      + partition_key_kind  = "Hash"
      + partition_key_paths = [
          + "/id",
        ]
      + resource_group_name = "faspo-poc-data-rg"
      + throughput          = (known after apply)

      + conflict_resolution_policy (known after apply)

      + indexing_policy (known after apply)
    }

  # azurerm_cosmosdb_sql_role_assignment.export-service-cdb-rbac will be updated in-place
  ~ resource "azurerm_cosmosdb_sql_role_assignment" "export-service-cdb-rbac" {
        id                  = "/subscriptions/8490b0ec-5a8a-4de8-bc0b-5cf01d498a30/resourceGroups/faspo-poc-data-rg/providers/Microsoft.DocumentDB/databaseAccounts/faspo-poc-cdb/sqlRoleAssignments/0e18702a-70bd-3e41-394c-2a136602d499"
        name                = "0e18702a-70bd-3e41-394c-2a136602d499"
      ~ role_definition_id  = "/subscriptions/8490b0ec-5a8a-4de8-bc0b-5cf01d498a30/resourceGroups/faspo-poc-data-rg/providers/Microsoft.DocumentDB/databaseAccounts/faspo-poc-cdb/sqlRoleDefinitions/00000000-0000-0000-0000-000000000001" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # azurerm_cosmosdb_sql_role_assignment.request-handler-cdb-rbac will be updated in-place
  ~ resource "azurerm_cosmosdb_sql_role_assignment" "request-handler-cdb-rbac" {
        id                  = "/subscriptions/8490b0ec-5a8a-4de8-bc0b-5cf01d498a30/resourceGroups/faspo-poc-data-rg/providers/Microsoft.DocumentDB/databaseAccounts/faspo-poc-cdb/sqlRoleAssignments/b3dcaca9-7a1c-01ba-30a8-b917da1201a4"
        name                = "b3dcaca9-7a1c-01ba-30a8-b917da1201a4"
      ~ role_definition_id  = "/subscriptions/8490b0ec-5a8a-4de8-bc0b-5cf01d498a30/resourceGroups/faspo-poc-data-rg/providers/Microsoft.DocumentDB/databaseAccounts/faspo-poc-cdb/sqlRoleDefinitions/00000000-0000-0000-0000-000000000001" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # azurerm_cosmosdb_sql_role_assignment.store-service-cdb-rbac will be updated in-place
  ~ resource "azurerm_cosmosdb_sql_role_assignment" "store-service-cdb-rbac" {
        id                  = "/subscriptions/8490b0ec-5a8a-4de8-bc0b-5cf01d498a30/resourceGroups/faspo-poc-data-rg/providers/Microsoft.DocumentDB/databaseAccounts/faspo-poc-cdb/sqlRoleAssignments/03a78a49-784a-7cbf-8da9-a2d87c7a957e"
        name                = "03a78a49-784a-7cbf-8da9-a2d87c7a957e"
      ~ role_definition_id  = "/subscriptions/8490b0ec-5a8a-4de8-bc0b-5cf01d498a30/resourceGroups/faspo-poc-data-rg/providers/Microsoft.DocumentDB/databaseAccounts/faspo-poc-cdb/sqlRoleDefinitions/00000000-0000-0000-0000-000000000002" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

Plan: 2 to add, 4 to change, 1 to destroy.
```
